IdeaRS.Connections
CleatData.ConnectionType Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the type of connection of two parts.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public CleatConnectionType ConnectionType { get; set; }
Property Value
Type: CleatConnectionType
See Also
Reference
CleatData Class
IdeaRS.Connections.Data Namespace